In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1542326457796, '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (2, 1542326688796, '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (3, 1542326926796, '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (4, 1542327111796, '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (5, 1542327312796, '44', 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('76', 'Jayden', 'Duffy', 'F', 'free'),
 ('101', 'Jayden', 'Fox', 'M', 'free'),
 ('86', 'Aiden', 'Hess', 'M', 'free'),
 ('36', 'Matthew', 'Jones', 'M', 'paid'),
 ('90', 'Andrea', 'Butler', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('SOBBUGU12A8C13E95D', 'Setting Fire to Sleeping Giants', 'ARMAC4T1187FB3FA4C', 2004, Decimal('207.77751')),
 ('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, Decimal('207.43791'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('ARMAC4T1187FB3FA4C', 'The Dillinger Escape Plan', 'Morris Plains, NJ', Decimal('40.82624'), Decimal('-74.47995')),
 ('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', Decimal('NaN'), Decimal('NaN'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 16, 0, 18, 33, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 22, 58, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 27, 7, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 5, 28, 12, 796000), 5, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 5, 32, 24, 796000), 5, 16, 46, 11, 2018, 'Friday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).